* COMMENT Org Tree Slide Mode
#+begin_src emacs-lisp
  (use-package org-tree-slide
    :ensure t
    :custom
    (org-image-actual-width nil))

  (defun efs/presentation-setup ()
    ;; Hide the mode line
    (display-line-numbers-mode 0)
    (beacon-mode 0)

    ;; Display images inline
    (org-display-inline-images) ;; Can also use org-startup-with-inline-images

    ;; Scale the text.  The next line is for basic scaling:
    ;;(setq text-scale-mode-amount 3)
    ;;(text-scale-mode 1))

  ;; This option is more advanced, allows you to scale other faces too
  ;; (setq-local face-remapping-alist '((default (:height 2.0) variable-pitch)
  ;;                                    (org-verbatim (:height 1.75) org-verbatim)
  ;;                                    (org-block (:height 1.25) org-block))))
  )
  (defun efs/presentation-end ()
    ;; Show the mode line again
    (display-line-numbers-mode 1)
    (beacon-mode 1)

    ;; Turn off text scale mode (or use the next line if you didn't use text-scale-mode)
    ;;(text-scale-mode 0))

    ;; If you use face-remapping-alist, this clears the scaling:
    ;;(setq-local face-remapping-alist '((default variable-pitch default))))
  )
  (use-package org-tree-slide
    :hook ((org-tree-slide-play . efs/presentation-setup)
           (org-tree-slide-stop . efs/presentation-end))
    :custom
    (org-tree-slide-slide-in-effect t)
    (org-tree-slide-activate-message "Greetings Everyone !!")
    (org-tree-slide-deactivate-message "We are at the end, Q/A ??")
    (org-tree-slide-header t)
    (org-tree-slide-breadcrumbs " > ")
    (org-image-actual-width nil))
#+end_src

#+RESULTS:
| efs/presentation-end |


